In [2]:
import pandas as pd

In [4]:
%ls

 C 드라이브의 볼륨: Windows
 볼륨 일련 번호: 44EC-5869

 C:\Users\rlath\JupyterNotebook\titanic 디렉터리

2018-08-13  오전 11:40    <DIR>          .
2018-08-13  오전 11:40    <DIR>          ..
2018-08-13  오전 11:40    <DIR>          .ipynb_checkpoints
2018-08-13  오전 11:40                72 180813_kaggle_titanic.ipynb
2018-08-13  오전 11:39            28,629 test.csv
2018-08-13  오전 11:39            61,194 train.csv
               3개 파일              89,895 바이트
               3개 디렉터리  199,248,404,480 바이트 남음

In [7]:
train = pd.read_csv('train.csv')
test = pd.read_csv('test.csv')

In [9]:
train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [11]:
train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [14]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [15]:
train['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [19]:
train.iloc[1]['Name']

'Cumings, Mrs. John Bradley (Florence Briggs Thayer)'

In [62]:
temp = train.groupby(['Survived', 'Sex', 'Pclass']).mean()
temp

                        PassengerId        Age     SibSp     Parch        Fare
Survived Sex    Pclass
0        female 1        325.000000  25.666667  0.666667  1.333333  110.604167
                2        423.500000  36.000000  0.500000  0.166667   18.250000
                3        440.375000  23.818182  1.291667  1.097222   19.773093
         male   1        413.623377  44.581967  0.272727  0.259740   62.894910
                2        454.010989  33.369048  0.307692  0.142857   19.488965
                3        456.750000  27.255814  0.523333  0.213333   12.204469
1        female 1        473.967033  34.939024  0.549451  0.428571  105.978159
                2        444.785714  28.080882  0.485714  0.642857   22.288989
                3        359.083333  19.329787  0.500000  0.500000   12.464526
         male   1        527.777778  36.248000  0.377778  0.311111   74.637320
                2        415.588235  16.022000  0.529412  0.647059   21.095100
                3        447.638298  22.274211  0.340426  0.297872   15.579696

In [61]:
# temp.loc[temp['Sex'] == 'female']
temp['Sex']

KeyError: 'Sex'

In [48]:
train.pivot_table('Survived', ['Sex', 'Pclass', 'Embarked'])

                        Survived
Sex    Pclass Embarked
female 1      C         0.976744
              Q         1.000000
              S         0.958333
       2      C         1.000000
              Q         1.000000
              S         0.910448
       3      C         0.652174
              Q         0.727273
              S         0.375000
male   1      C         0.404762
              Q         0.000000
              S         0.354430
       2      C         0.200000
              Q         0.000000
              S         0.154639
       3      C         0.232558
              Q         0.076923
              S         0.128302

In [32]:
# test['Survived'] = ''
# if test['Sex'] == 'female':
#     test['Survived'] = 1
# else:
#     test['Survived'] = 1

In [33]:
test['Survived'] = test['Sex'] == 'female'

In [36]:
test['Survived'] = test['Survived'].astype(int)

In [37]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,0
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,1
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,0
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,0
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,1

In [40]:
submission = test[['PassengerId', 'Survived']].copy()

In [41]:
submission.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [42]:
%mkdir submissions

In [44]:
submission.to_csv('submissions/submission.csv', index=False)

In [63]:
my_train = train.copy()

In [65]:
my_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
my_train